[UniversalSoldier X2SoldierClassTemplate]
+DisplayName="Soldier"
+ClassSummary=""
AbilityTreeTitles[0]="Assault"
AbilityTreeTitles[1]="Infantry"
AbilityTreeTitles[2]="Sentinel"
AbilityTreeTitles[3]="Gunner"
AbilityTreeTitles[4]="Grenadier"
AbilityTreeTitles[5]="Sniper"
AbilityTreeTitles[6]="Ranger"
AbilityTreeTitles[7]="Hacker"
AbilityTreeTitles[8]="Scout"
AbilityTreeTitles[9]="Medic"
AbilityTreeTitles[10]="Gunslinger"
AbilityTreeTitles[11]="Skirmisher"
AbilityTreeTitles[12]="Saboteur"
AbilityTreeTitles[13]="Spotter"

[HighNoon X2AbilityTemplate]
LocFriendlyName="High Noon"
LocFlyOverText="High Noon"
LocHelpText="Whenever targeted by enemy fire, automatically fire back first with your <Ability:WeaponName/>."
LocLongDescription="Whenever targeted by enemy fire, automatically fire back first with your <Ability:WeaponName/>."
LocPromotionPopupText="<Bullet/> High Noon can be triggered by melee attacks and Area of Effect attacks.<br/><Bullet/> High Noon will not trigger when targeted by Overwatch fire.<br/>"

[LightEmUp X2AbilityTemplate]
LocFriendlyName="Light 'Em Up"
LocFlyOverText="Light 'Em Up"
LocLongDescription="Taking a standard shot with your primary weapon as your first action no longer ends your turn."
LocHelpText="Taking a standard shot with your primary weapon as your first action no longer ends your turn."
LocPromotionPopupText="<Bullet/> Taking a standard shot with your primary weapon as your first action no longer ends your turn.<br/>"

[Lockdown X2AbilityTemplate]
LocFriendlyName="Lockdown"
LocFlyOverText="Lockdown"
LocLongDescription="Gain +15 to hit against enemies who attempt to move when suppressed."
LocHelpText="Bonus hit chance and damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain +15 to hit against enemies who attempt to move when suppressed.<br/><Bullet/> This stacks with other reaction fire bonuses."

[Lockdown X2AbilityTemplate]
LocFriendlyName="Lockdown"
LocFlyOverText="Lockdown"
LocLongDescription="Gain +15 to hit against enemies who attempt to move when suppressed."
LocHelpText="Bonus hit chance and damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain +15 to hit against enemies who attempt to move when suppressed.<br/><Bullet/> This stacks with other reaction fire bonuses."

[FullAutoFire X2AbilityTemplate]
LocFriendlyName="Full Autofire"
LocHelpText="+1 damage per ammo left in the clip. Less accurate against targets in cover, consumes full clip, destroys cover but cannot be dodged. Needs 2 action points and 3 ammo minimum to be activated."
LocLongDescription="Fire a long burst at a target that does +1 damage per ammo left in the clip. The shot is less accurate against targets in cover, consumes full clip, destroys cover but cannot be dodged. Needs 2 action points and 3 ammo minimum to be activated."
LocPromotionPopupText="<Bullet/>+1 damage per ammo in the clip<br/><Bullet/>-10 aim for low cover<br/><Bullet/>-20 aim for full cover<br/><Bullet/>destroys cover<br/><Bullet/>consumes whole clip<br/><Bullet/>Needs a minimum of 2 AP and 3 ammo to be actived.<br/>"

[AutoFireModifications X2AbilityTemplate]
LocFriendlyName="Full Autofire"

[AutoFireShot X2AbilityTemplate]
LocFriendlyName="Fire Cannon"
LocHelpText="Fire a shot at a target. <Ability:CANNOTBEDODGED/>"
LocLongDescription="Firing the primary weapon always ends a unit's turn."

[AutoFireOverwatch X2AbilityTemplate]
LocFriendlyName="Cannon Overwatch"
LocHelpText="Fire on the first enemy that moves within your line of sight with a penalty to aim."
LocLongDescriptionWhenConcealed="Fire on the first enemy that moves within your line of sight but only if revealed."
LocFlyOverText="Overwatch"
LocFriendlyNameWhenConcealed="Overwatch (Concealed)"

[Grenadier X2AbilityTemplate]
LocFriendlyName="Grenadier"
LocFlyOverText="Grenadier"
LocLongDescription="Adds a dedicated grenade slot."
LocHelpText="Adds a dedicated grenade slot."
LocPromotionPopupText="<Bullet/>Adds a dedicated grenade slot."

[Gunner X2AbilityTemplate]
LocFriendlyName="Gunner"
LocFlyOverText="Gunner"
LocLongDescription="Adds a dedicated ammo slot."
LocHelpText="Adds a dedicated ammo slot."
LocPromotionPopupText="<Bullet/>Adds a dedicated ammo slot."

[HeavyWeaponMobilityPenalty X2AbilityTemplate]
LocFriendlyName="Heavy Weapon"
LocFlyOverText="Heavy Weapon"
LocLongDescription="Heavy Weapons impose a -25% Mobility penalty."
LocHelpText="Heavy Weapons impose a -25% Mobility penalty."
LocPromotionPopupText="<Bullet/>Heavy Weapons impose a -25% Mobility penalty."

[CombatProtocolHackingBonus X2AbilityTemplate]
LocFriendlyName="Hacker"
LocFlyOverText="Hacker"
LocLongDescription="Grants +<Ability:Hacking/> Hacking."
LocHelpText="Grants +<Ability:Hacking/> Hacking."
LocPromotionPopupText="<Bullet/>Grants +<Ability:Hacking/> Hacking."

[RpgCutthroat X2AbilityTemplate]
LocFriendlyName="Cutthroat"
LocFlyOverText="Cutthroat"
LocLongDescription="Your melee attacks against biological enemies ignore their armor, have a +15 critical chance, and do +2 critical damage."
LocHelpText="Your melee attacks against biological enemies ignore their armor, have a +15 critical chance, and do +2 critical damage."
LocPromotionPopupText="<Bullet/> Your melee attacks against biological enemies ignore their armor, have a +15 critical chance, and do +2 critical damage."

[Relocation X2AbilityTemplate]
LocFriendlyName="Relocation"
LocFlyOverText="Relocation"
LocLongDescription="Refunds one action point when you are revealed from concealment via your own action."
LocHelpText="Refunds one action point when you are revealed from concealment via your own action."
LocPromotionPopupText="<Bullet/> Refunds one action point when you are revealed from concealment via your own action.<br/><Bullet/> Only applies to actions taken during your turn.<br/><Bullet/> Does not activate when using abilities that do not cost an action point.<br/>"

[RpgTacticalSense X2AbilityTemplate]
LocFriendlyName="Tactical Sense"
LocFlyOverText="Tactical Sense"
LocLongDescription="Gain 3 defense for each enemy you can see, up to a maximum of 15 defense."
LocHelpText="Gain 3 defense for each enemy you can see, up to a maximum of 15 defense."
LocPromotionPopupText="<Bullet/> Gain 3 defense for each living enemy you can see, up to a maximum of 15 defense.<br/><Bullet/> Units visible at squadsight ranges do not confer bonus.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[Interference X2AbilityTemplate]
LocFriendlyName="Interference"
LocFlyOverText="Interference"
LocLongDescription="GREMLIN cancels overwatch on targeted unit. Use three times per battle."
LocHelpText="Cancels overwatch on targeted unit."
LocPromotionPopupText="<Bullet/> Cancels overwatch on targeted unit.<br/><Bullet/> Uses one action.<br/><Bullet/> 3 charges per battle, improves with better Gremlin tech.<br/>"

[RpgAggression X2AbilityTemplate]
LocFriendlyName="Aggression"
LocFlyOverText="Aggression"
LocLongDescription="Gain +5 critical chance for each enemy you can see, up to a maximum of 30."
LocHelpText="Gain +5 critical chance for each enemy you can see, up to a maximum of 30."
LocPromotionPopupText="<Bullet/> Gain +5 critical chance for each enemy you can see, up to a maximum of 30.<br/><Bullet/> Units visible at squadsight ranges do confer bonus.<br/>"

[RpgStealthTactics X2AbilityTemplate]
LocFriendlyName="Stealth Tactics"
LocLongDescription="If you see no enemy at the beginning of your turn you enter concealment."
LocHelpText="<Bullet/>If you see no enemy at the beginning of your turn you enter concealment."
LocFlyOverText="StealthTactics" 
LocPromotionPopupText="If you see no enemy at the beginning of your turn you enter concealment."

[RpgDangerSense X2AbilityTemplate]
LocFriendlyName="Danger Sense"
LocLongDescription="Track movement 20 meters around him. Cannot be surprised be faceless or burrowed chryssalids."
LocHelpText="Track movement 20 meters around him. Cannot be surprised be faceless or burrowed chryssalids."
LocFlyOverText="Danger Sense"
LocPromotionPopupText="<Bullet/>Tracks movement within 20 meters. Can't be surprised be faceless or burrowed chryssalids<br/>"

[RpgZoneOfControl X2AbilityTemplate]
LocFriendlyName="Zone of Control"
LocLongDescription="Open preemptive fire with the Handgun on any enemy withing 7 tiles of your location that tries to attack your squad."
LocHelpText="Open preemptive fire with the Handgun on any enemy withing 7 tiles of your location that tries to attack your squad."
LocFlyOverText="Zone of Control"
LocPromotionPopupText="Allows to maintain control of their immediate area by defending against attackers in close quarters.<br/><Bullet/>Open preemptive fire with the Handgun on any enemy withing 5 tiles of your location that tries to attack your squad."

[RescueProtocol X2AbilityTemplate]
LocFriendlyName="Rescue Protocol"
LocFlyoverText="Rescue Protocol"
LocLongDescription="Use your Gremlin to grant a movement action to an ally."
LocHelpText="Grant a movement action to an ally."
LocPromotionPopupText="<Bullet/> Rescue Protocol can only be used on allies with no action points left.<br/><Bullet/> It cannot be used on concealed, suppressing or overwatching units.<br/><Bullet/>An ally cannot benefit from both Command and Rescue Protocol in the same turn.<br/><Bullet/> Uses one action.<br/><Bullet/> Charges increase with improved Gremlin technology.<br/>"

[Quartermaster X2AbilityTemplate]
LocFriendlyName="Quartermaster"
LocFlyoverText="Quartermaster"
LocLongDescription="Any consumable item in the utility slot gets an additional charge."
LocHelpText="Any consumable item in the utility slot gets an additional charge."
LocPromotionPopupText="<Bullet/>Any consumable item in the utility slot gets an additional charge."

[Sabotage X2AbilityTemplate]
LocFriendlyName="Sabotage"
LocFlyoverText="Sabotage"
LocLongDescription="Claymores, Composite Explosives and Proximity Mines do <Ability:+Damage/> points more damage."
LocHelpText="Claymores, Composite Explosives and Proximity Mines do <Ability:+Damage/> points more damage."
LocPromotionPopupText="<Bullet/>Claymores, Composite Explosives and Proximity Mines do <Ability:+Damage/> points more damage."

[Overkill X2AbilityTemplate]
LocFriendlyName="Overkill"
LocFlyoverText="Overkill"
LocLongDescription="Claymores, Composite Explosives and Proximity Mines equipped have one additional charge."
LocHelpText="Claymores, Composite Explosives and Proximity Mines equipped have one additional charge."
LocPromotionPopupText="<Bullet/>Claymores, Composite Explosives and Proximity Mines equipped have one additional charge."

[Rocketeer X2AbilityTemplate]
LocFriendlyName="Rocketeer"
LocFlyOverText="Rocketeer"
LocHelpText="Your equipped heavy weapon gets an additional use."
LocLongDescription="Your equipped heavy weapon gets an additional use."

[AreaSuppression X2AbilityTemplate]
LocFriendlyName="Area Suppression"
LocFlyOverText="Area Suppression"
LocLongDescription="Fire a barrage that pins down multiple targets within a 4-tile radius, granting reaction fire against anyone that moves, and imposing a <Ability:SUPPRESSIONPENALTY/> penalty to all targets' aim until suppression is removed. Cannot be used when concealed."
LocHelpText="Suppress multiple targets within an area of effect."
LocPromotionPopupText="<Bullet/> Area Suppression cannot be used when the soldier is concealed.<br/><Bullet/> Any unit that attempts to move will face reaction fire as long as the suppressing unit has ammo remaining.<br/><Bullet/> Does not work with shotguns or sniper rifles.<br/><Bullet/> Area Suppression costs <Ability:SelfAmmoCost/> ammo points to use, plus one additional ammo for each reaction shot. It has no cooldown.<br/><Bullet/> Area suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> If multiple units suppress a target, the aim penalty will stack.<br/><Bullet/> Suppression restricts many of the target's abilities, including the use of rockets and grenades."

[CloseandPersonal X2AbilityTemplate]
LocFriendlyName="Close and Personal"
LocFlyOverText="Close and Personal"
LocLongDescription="Confers +30 critical chance against adjacent targets. The bonus declines with distance from the target."
LocHelpText="Confers +30 critical chance against adjacent targets. The bonus declines with distance from the target."
LocPromotionPopupText="<Bullet/> Confers +30 critical chance against adjacent targets.<br/><Bullet/> Bonus reduced by 5% for each additional tile of distance from the target, down to 0% at 7 or more tiles.<br/>"

[CloseEncounters X2AbilityTemplate]
LocFriendlyName="Close Encounters"
LocFlyOverText="Close Encounters"
LocLongDescription="Once per turn, gain a bonus action after taking a standard shot with your primary weapon at an enemy within four tiles."
LocHelpText="Once per turn, gain a bonus action after taking a standard shot with your primary weapon at an enemy within four tiles."
LocPromotionPopupText="<Bullet/> Once per turn, gain a bonus action after taking a standard shot with your primary weapon at an enemy within four tiles.<br/><Bullet/> A red ring will mark the range of this ability.<br/><Bullet/> Close Encounters cannot be used on the same turn as Run and Gun.<br/>"

[BringEmOn X2AbilityTemplate]
LocFriendlyName="Bring 'Em On"
LocFlyOverText="Bring 'Em On"
LocLongDescription="Gain +1 damage on critical hits for every two enemies you can see, up to a maximum of +8."
LocHelpText="Gain +1 damage on critical hits for every two enemies you can see, up to a maximum of +8."
LocPromotionPopupText="<Bullet/> Gain +1 damage on critical hits for every two enemies you can see, up to a maximum of +8.<br/><Bullet/> Units visible at squadsight ranges do confer bonus.<br/><Bullet/> Applies to damage from primary weapon only."

[CloseCombatSpecialist X2AbilityTemplate]
LocFriendlyName="Close Combat Specialist"
LocFlyOverText="Close Combat Specialist"
LocLongDescription="During enemy turns, fire a free reaction shot with your primary weapon at any visible enemy within four tiles who moves or fires."
LocHelpText="During enemy turns, Fire a free reaction shot at any visible enemy within four tiles who moves or fires."
LocPromotionPopupText="<Bullet/> Will not trigger if soldier is concealed.<br/><Bullet/> You may shoot at each enemy with this ability once per turn.<br/><Bullet/> Each shot requires 2 ammo.<br/>"

[Lethal X2AbilityTemplate]
LocFriendlyName="Lethal"
LocFlyOverText="Lethal"
LocLongDescription="You do two additional points of base damage with any weapon."
LocHelpText="You do two additional points of base damage with any weapon."
LocPromotionPopupText="<Bullet/> You do two additional points of base damage with any weapon."

[SurgicalPrecision X2AbilityTemplate]
LocFriendlyName="Surgical Precision"
LocFlyOverText="Surgical Precision"
LocLongDescription="Reduces aim penalties from cover by half"
LocHelpText="Reduces aim penalties from cover by half"
LocPromotionPopupText="<Bullet/>Reduces aim penalties from cover by half"

[RapidTargeting X2AbilityTemplate]
LocFriendlyName="Rapid Targeting"
LocLongDescription="You may Holotarget an enemy as a free action with a <Ability:RAPID_TARGETING_COOLDOWN_LW/>-turn cooldown. In addition, Holotargeting no longer ends your turn."
LocHelpText="Activate to Holotarget an enemy as a free action."
LocFlyOverText="Holotarget"
LocPromotionPopupText="<Bullet/> Using your Holotargeter no longer ends your turn.<br/><Bullet/> In addition, Rapid Targeting lets you periodically use Holotargeting against a single enemy as a free action.<br/><Bullet/> This works with HiDef Holo, Independent Tracking, and Vital Point Targeting.<br/><Bullet/> This does not stack with Multitargeting.<br/><Bullet/> This ability has a <Ability:RAPID_TARGETING_COOLDOWN_LW/> turn cooldown.<br/><Bullet/> Holotargeting does not break concealment for your squad."

[RapidTargeting_Passive X2AbilityTemplate]
LocFriendlyName="Rapid Targeting"
LocLongDescription="Using your Holotargeter no longer automatically ends your turn."

[HDHolo X2AbilityTemplate]
LocFriendlyName="HiDef Holo"
LocLongDescription="Your Holotargeted enemies are easier to critically hit."
LocHelpText="Your Holotargeted enemies are easier to critically hit."
LocFlyOverText="HiDef Holo"
LocPromotionPopupText="<Bullet/> The critical hit bonus is +<Ability:HDHOLO_CV_CRIT_BONUS_LW/> with the basic Holotargeter, but improves to +<Ability:HDHOLO_MG_CRIT_BONUS_LW/> and +<Ability:HDHOLO_BM_CRIT_BONUS_LW/> with advanced technology Holotargeting devices.<br/>"

[IndependentTracking X2AbilityTemplate]
LocFriendlyName="Independent Tracking"
LocLongDescription="A Holotargeted enemy will remain so for <Ability:INDEPENDENT_TRACKING_BONUS_TURNS_LW/> additional turn(s)."
LocHelpText="A Holotargeted enemy will remain so for <Ability:INDEPENDENT_TRACKING_BONUS_TURNS_LW/> additional turn(s)."
LocFlyOverText="Independent Tracking"
LocPromotionPopupText="<Bullet/> A Holotargeted enemy remains so for <Ability:INDEPENDENT_TRACKING_BONUS_TURNS_LW/> additional turn(s).<br/><Bullet/> Additional uses of Holotargeting on the same target will not stack.<br/>"

[VitalPointTargeting X2AbilityTemplate]
LocFriendlyName="Vital Point Targeting"
LocLongDescription="Attacks against your Holotargeted enemies deal more damage."
LocHelpText="Attacks against your Holotargeted enemies deal more damage."
LocFlyOverText="Vital Point Targeting"
LocPromotionPopupText="<Bullet/> The Vital Point Targeting damage bonus is +<Ability:VITAL_POINT_CV_BONUS_DMG_LW/> for the basic Holotargeter, and increases to +<Ability:VITAL_POINT_BM_BONUS_DMG_LW/> with improved Holotargeting technology.<br/><Bullet/> Damage bonus is applied to melee and direct (non-Area of Effect) projectile attacks."

[Multitargeting X2AbilityTemplate]
LocFriendlyName="Multitargeting"
LocLongDescription="You may Holotarget multiple enemies with a <Ability:MULTI_TARGETING_COOLDOWN_LW/>-turn cooldown."
LocHelpText="Holotarget multiple enemies in an area of effect."
LocFlyOverText="Multitargeting"
LocPromotionPopupText="<Bullet/> HiDef Holo, Independent Tracking, and Vital Point Targeting apply to all targets.<br/><Bullet/> Area of effect radius is <Ability:MULTI_HOLO_CV_RADIUS_LW/> tiles for the basic Holotargeter and improves to <Ability:MULTI_HOLO_MG_RADIUS_LW/> and <Ability:MULTI_HOLO_BM_RADIUS_LW/> tiles with better technology.<br/><Bullet/> This ability has a <Ability:MULTI_TARGETING_COOLDOWN_LW/> turn cooldown.<br/><Bullet/> Holotargeting does not break concealment for your squad."

[HotShot X2AbilityTemplate]
LocFriendlyName="Hotshot"
LocFlyoverText="Hotshot"
LocLongDescription="Gain +<Ability:ToHit/> aim on reaction fire shots."
LocHelpText="Gain +<Ability:ToHit/> aim on reaction fire shots."
LocPromotionPopupText="<Bullet/>Gain +<Ability:ToHit/> on reaction fire shots."

[EagleEye X2AbilityTemplate]
LocFriendlyName="Eagle Eye"
LocFlyoverText="Eagle Eye"
LocLongDescription="Gain +<Ability:ToHit/> aim on non reaction fire shots."
LocHelpText="Gain +<Ability:ToHit/> aim on non reaction fire shots."
LocPromotionPopupText="<Bullet/>Gain +<Ability:ToHit/> on non reaction fire shots."

[Runner X2AbilityTemplate]
LocFriendlyName="Runner"
LocFlyoverText="Runner"
LocLongDescription="Soldier gets +<Ability:Mobility/> mobility."
LocHelpText="Soldier gets +<Ability:Mobility/> mobility."
LocPromotionPopupText="<Bullet/>Soldier gets +<Ability:Mobility/> mobility."

[MovingTarget X2AbilityTemplate]
LocFriendlyName="Moving Target"
LocFlyoverText="Moving Target"
LocLongDescription="Soldier gets +<Ability:Dodge/> dodge."
LocHelpText="Soldier gets +<Ability:Dodge/> dodge."
LocPromotionPopupText="<Bullet/>Soldier gets +<Ability:Dodge/> dodge."

[Praetorian X2AbilityTemplate]
LocFriendlyName="Praetorian"
LocFlyoverText="Praetorian"
LocLongDescription="Gain +<Ability:ToHit/> aim on melee attacks."
LocHelpText="Gain +<Ability:ToHit/> aim on melee attacks."
LocPromotionPopupText="<Bullet/>Gain +<Ability:ToHit/> aim on melee attacks."

[CyberAdept X2AbilityTemplate]
LocFriendlyName="Cyber Adept"
LocFlyoverText="CyberAdept"
LocLongDescription="Soldier gets +<Ability:Hacking/> hacking."
LocHelpText="Soldier gets +<Ability:Hacking/> hacking."
LocPromotionPopupText="<Bullet/>Soldier gets +<Ability:Hacking/> hacking."

[IronWill X2AbilityTemplate]
LocFriendlyName="Iron Will"
LocFlyoverText="Iron Will"
LocLongDescription="Soldier gets +<Ability:Will/> will."
LocHelpText="Soldier gets +<Ability:Will/> will."
LocPromotionPopupText="<Bullet/>Soldier gets +<Ability:Will/> will."

[Stalker X2AbilityTemplate]
LocFriendlyName="Stalker"
LocFlyoverText="Stalker"
LocLongDescription="Soldier has 20% reduced detection radius."
LocHelpText="Soldier has 20% reduced detection radius."
LocPromotionPopupText="<Bullet/>Soldier has 20% reduced detection radius."

[Juggernaut X2AbilityTemplate]
LocFriendlyName="Juggernaut"
LocFlyoverText="Juggernaut"
LocLongDescription="Soldier gets +<Ability:HP/> HP."
LocHelpText="Soldier gets +<Ability:HP/> HP."
LocPromotionPopupText="<Bullet/>Soldier gets +<Ability:HP/> HP."

[Bulletproof X2AbilityTemplate]
LocFriendlyName="Bulletproof"
LocFlyoverText="Bulletproof"
LocLongDescription="Soldier gets +<Ability:Defense/> Defense."
LocHelpText="Soldier gets +<Ability:Defense/> Defense."
LocPromotionPopupText="<Bullet/>Soldier gets +<Ability:Defense/> Defense."

[Hitman X2AbilityTemplate]
LocFriendlyName="Hitman"
LocFlyoverText="Hitman"
LocLongDescription="Soldier gets +<Ability:Crit/> Crit Chance against flanked targets."
LocHelpText="Soldier gets +<Ability:Crit/> Crit Chance against flanked targets."
LocPromotionPopupText="<Bullet/>Soldier gets +<Ability:Crit/> Crit Chance against flanked targets."

[Prodigy X2AbilityTemplate]
LocFriendlyName="Prodigy"
LocFlyoverText="Prodigy"
LocLongDescription="The Soldier Combat Intelligence is one or two levels higher than rolled."
LocHelpText="The Soldier Combat Intelligence is one or two levels higher than rolled."
LocPromotionPopupText="<Bullet/>The Soldier Combat Intelligence is one or two levels higher than rolled."

[ShotgunDamageModifierRange X2AbilityTemplate]
LocFriendlyName="Shotgun Range"
LocFlyoverText="Shotgun Range"

[ShotgunDamageModifierCoverType X2AbilityTemplate]
LocFriendlyName="Shotgun Cover"
LocFlyoverText="Shotgun Cover"

[DamageModifierCoverType X2AbilityTemplate]
LocFriendlyName="Cover"
LocFlyoverText="Cover"

[ZoneOfControlReturnFire X2AbilityTemplate]
LocFriendlyName="Zone of Control"
LocFlyoverText="Zone of Control"

[ReadyForAnything X2AbilityTemplate]
LocFriendlyName="Ready for Anything"
LocLongDescription="When you make a standard attack with your <Ability:WeaponName/> you automatically enter overwatch."
LocHelpText="Fire a shot at a target, then enter overwatch."
LocFlyOverText="Ready for Anything"
LocPromotionPopupText="<Bullet/> You won't enter overwatch if you are out of ammo.<br/>"

[Deadeye X2AbilityTemplate]
LocFriendlyName="Deadeye"
LocFlyoverText="Deadeye"
LocLongDescription="Confers +<Ability:ToHit/> aim and +<Ability:Crit/> Crit against unflankable targets."
LocHelpText="Confers +<Ability:ToHit/> aim and +<Ability:Crit/> Crit against unflankable targets."
LocPromotionPopupText="<Bullet/>Confers +<Ability:ToHit/> aim and +<Ability:Crit/> Crit against unflankable targets."

[HitandRun X2AbilityTemplate]
LocFriendlyName="Hit and Run"
LocFlyOverText="Hit and Run"
LocLongDescription="Once per turn, gain an additional action after taking a standard shot at a flanked or exposed target with your primary weapon."
LocHelpText="Once per turn, gain an additional action after taking a standard shot at a flanked or exposed target with your primary weapon."
LocPromotionPopupText="<Bullet/> Cannot be used on the same turn as Run and Gun.<br/><Bullet/> Bonus full actions from Serial and Death from Above will be awarded first."

[KillEmAll X2AbilityTemplate]
LocFriendlyName="Kill'Em'All"
LocFlyOverText="Kill'Em'All"
LocLongDescription="Take a shot at every enemy in a cone area."
LocHelpText="Take a shot at every enemy in a cone area."
LocPromotionPopupText="<Bullet/>Take a shot at every enemy in a cone area."

[SniperElite X2AbilityTemplate]
LocFriendlyName="Sniper Elite"
LocFlyOverText="Sniper Elite"
LocLongDescription="Removes squadsight penalties and squadsight also applies after moving."
LocHelpText="Removes squadsight penalties and squadsight also applies after moving."
LocPromotionPopupText="<Bullet/>Removes squadsight penalties and squadsight also applies after moving."

[Failsafe X2AbilityTemplate]
LocFriendlyName="Failsafe"
LocLongDescription="If you fail a hack, you prevent any negative effects from occurring."
LocHelpText="If you fail a hack, you prevent any negative effects from occurring."
LocFlyOverText="Failsafe"
LocPromotionPopupText="<Bullet/> If you fail a hack, you prevent any negative effects from occurring."

[PermanentTracking X2AbilityTemplate]
LocFriendlyName="Permanent Tracking"
LocLongDescription="Targets marked by the holotargeter or battlescanners remains permanently visible."
LocHelpText="Targets marked by the holotargeter or battlescanners remains permanently visible."
LocFlyOverText="PermanentTracking"
LocPromotionPopupText="<Bullet/>Targets marked by the holotargeter or battlescanners remains permanently visible"

[Kenjutsu X2AbilityTemplate]
LocFriendlyName="Kenjutsu"
LocLongDescription="Slashing targets within blue move range no longer ends turn."
LocHelpText="Slashing targets within blue move range no longer ends turn."
LocFlyOverText="Kenjutsu"
LocPromotionPopupText="<Bullet/>Slashing targets within blue move range no longer ends turn."

[EmergencyProtocol X2AbilityTemplate]
LocFriendlyName="Emergency Protocol"
LocLongDescription="Heal and Stabilize are free actions."
LocHelpText="Heal and Stabilize are free actions."
LocFlyOverText="Emergency Protocol"
LocPromotionPopupText="<Bullet/>Heal and Stabilize are free actions."

[FieldSurgeon X2AbilityTemplate]
LocFriendlyName="Field Surgeon"
LocFlyOverText="Field Surgeon"
LocLongDescription="Reduce wound recovery times for most soldiers."
LocHelpText="Reduce wound recovery times for most soldiers."
LocPromotionPopupText="<Bullet/> Field Surgeon reduces the number of hit points a soldier must heal after being wounded in battle by 1.<br/><Bullet/> Multiple Field Surgeons on a mission have a chance to reduce wound recovery time further.<br/><Bullet/> The effect includes the soldier with the ability.<br/><Bullet/> It does not affect soldiers who suffered killing wounds and are stabilized from bleeding out."

[TriggerHappy X2AbilityTemplate]
LocFriendlyName="Trigger Happy"
LocLongDescription="Take a reaction shot when a new group of enemies is revealed."
LocHelpText="Take a reaction shot when a new group of enemies is revealed."
LocFlyOverText="Trigger Happy"
LocPromotionPopupText="<Bullet/>Take a reaction shot when a new group of enemies is revealed."

[Bombard_LW X2AbilityTemplate]
LocFriendlyName="Bombardier"
LocLongDescription="You may throw or launch grenades four additional tiles."
LocHelpText="You may throw or launch grenades for additional tiles."
LocFlyOverText="Bombardier"
LocPromotionPopupText="<Bullet/> Your grenades have 4 tiles extra range.<br/><Bullet/> This includes either launched or thrown grenades.<br/>"

[RpgDeathFromAbove X2AbilityTemplate]
LocFriendlyName="Death From Above"
LocLongDescription="Killing an enemy at a lower elevation with your <Ability:WeaponName/> costs only a single action and does not end your turn. Only triggers once per turn."
LocHelpText="Killing an enemy at a lower elevation with your <Ability:WeaponName/> costs only a single action and does not end your turn. Only triggers once per turn."
LocFlyOverText="Death From Above"
LocPromotionPopupText="<Bullet/> Death From Above can combo well with <Ability:SecondaryWeaponName/> abilities, or can simply make the <Ability:ClassName/> more mobile.<br/>"


;--------------------------------------------------
;----------------- Overrides ----------------------
;--------------------------------------------------
[TracerRounds X2AbilityTemplate]
LocFriendlyName="Tracer Rounds"
LocHelpText="Adds Holotargeting Ability"

[SwordSlice X2AbilityTemplate]
LocFriendlyName="Slash"
LocLongDescription="Attack any enemy within movement range with your melee weapon."
LocHelpText="Attack an enemy within movement range with your melee weapon."
LocPromotionPopupText="<Bullet/> You can trigger the Slash ability by placing the movement cursor over an enemy.<br/><Bullet/> A Ranger can perform a \"Dash\" move, using both actions to move, and still trigger a Slash against an adjacent enemy.<br/>"

; ---------- Blademaster Path ----------------

[Blademaster X2AbilityTemplate]
LocFriendlyName="Blademaster"
LocLongDescription="All melee weapons attacks deal +<Ability:BlademasterDmg/> extra damage and have +<Ability:BLADEMASTERAIM/> Aim."
LocHelpText="Extra damage and aim on all melee weapon attacks."
LocFlyOverText="Blademaster"
LocPromotionPopupText="<Bullet/> Blademaster deals a bonus +<Ability:BlademasterDmg/> damage on every successful melee attack.<br/><Bullet/> Blademaster grants +<Ability:BLADEMASTERAIM/> Aim to melee attacks.<br/>"

[Bladestorm X2AbilityTemplate]
LocFriendlyName="Bladestorm"
LocLongDescription="Free melee attacks on any enemies that enter or attack from melee range."
LocHelpText="Free melee attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Bladestorm"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Bladestorm will trigger if that enemy tries to attack the <Ability:ClassName/>.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Bladestorm will trigger when that enemy moves into melee range.<br/>"

[BladestormAttack X2AbilityTemplate]
LocFriendlyName="Bladestorm"
LocLongDescription="Free melee attacks on any enemies that enter or attack from melee range."
LocHelpText="Free melee attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Bladestorm"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Bladestorm will trigger if that enemy tries to attack the <Ability:ClassName/>.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Bladestorm will trigger when that enemy moves into melee range.<br/>"

[ReturnFire X2AbilityTemplate]
LocFriendlyName="Return Fire"
LocHelpText="When targeted by enemy fire, automatically fire back with your Handgun once per turn."
LocLongDescription="When targeted by enemy fire, automatically fire back with your Handgun once per turn."
LocPromotionPopupText="<Bullet/> Return Fire will only trigger once per turn.<br/><Bullet/> Return Fire can be triggered by melee attacks and Area of Effect attacks.<br/><Bullet/> Return Fire will not trigger when targeted by Overwatch fire.<br/>"

[Quickdraw X2AbilityTemplate]
LocFriendlyName="Quickdraw"
LocLongDescription="Firing your Handgun with your first action no longer ends your turn."
LocHelpText="Firing your Handgun with your first action no longer ends your turn."
LocFlyOverText="Quickdraw"
LocPromotionPopupText="<Bullet/> Quickdraw is a fundamental Handgun ability, as it allows the <Ability:ClassName/> to spread their fire around to different targets in the same turn.<br/>"

[FanFire X2AbilityTemplate]
LocFriendlyName="Fan Fire"
LocLongDescription="Fire the handgun three times at the same target."
LocHelpText="Fire three times at a single target"
LocFlyOverText="Fan Fire"
LocPromotionPopupText="<Bullet/> Each shot in Fan Fire rolls a separate chance to hit.<br/><Bullet/> Fan Fire can deal a devastating amount of damage if every shot hits.<br/><Bullet/> Fan Fire has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[LightningHands X2AbilityTemplate]
LocFriendlyName="Lightning Hands"
LocLongDescription="Fire your Handgun at a target. This attack does not cost an action."
LocHelpText="Fire your Handgun at a target. This attack does not cost an action."
LocFlyOverText="Lightning Hands"
LocPromotionPopupText="<Bullet/> Lightning Hands can combo well with other <Ability:ClassName/> abilities, as it does not prevent the use of other abilities in the same turn.<br/><Bullet/> Lightning Hands has a <Ability:SelfCooldown/> turn cooldown.<br/>"

; Colonel
[Faceoff X2AbilityTemplate]
LocFriendlyName="Faceoff"
LocLongDescription="Fire once at every visible enemy with your pistol."
LocHelpText="Fire once at every visible enemy with your pistol."
LocPromotionPopupText="<Bullet/> Faceoff is best augmented by aggressive field positioning, granting a high chance to hit at multiple targets.<br/><Bullet/> Faceoff has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[IntrusionProtocol X2AbilityTemplate]
LocFriendlyName="Hack"
LocLongDescription="Attempt to remotely breach security on a network access point with your GREMLIN."
LocHelpText="You can remotely hack targets with your GREMLIN."
LocFlyOverText="Hack"
LocDefaultSecondaryWeapon="GREMLIN"
LocPromotionPopupText="<Bullet/> Remotely hack ADVENT targets, including mission objectives, with your GREMLIN drone. <br/><Bullet/> Upgrade your GREMLIN drone to increase this soldier's hacking stat.<br/>"

[IntrusionProtocol_Chest X2AbilityTemplate]
LocFriendlyName="Hack Chest"
LocLongDescription="Attempt to breach security on a chest with your GREMLIN."
LocHelpText="You can hack chests with your GREMLIN."
LocFlyOverText="Hack"
LocDefaultSecondaryWeapon="GREMLIN"

[IntrusionProtocol_Workstation X2AbilityTemplate]
LocFriendlyName="Hack Workstation"
LocLongDescription="Attempt to breach security on a workstation with your GREMLIN."
LocHelpText="You can hack workstations with your GREMLIN."
LocFlyOverText="Hack"
LocDefaultSecondaryWeapon="GREMLIN"

[IntrusionProtocol_ObjectiveChest X2AbilityTemplate]
LocFriendlyName="Hack Chest"
LocLongDescription="Attempt to breach security on a chest with your GREMLIN."
LocHelpText="You can hack chests with your GREMLIN."
LocFlyOverText="Hack"
LocDefaultSecondaryWeapon="GREMLIN"

[IntrusionProtocolPassive X2AbilityTemplate]
LocFriendlyName="Remote Hacking"
LocLongDescription="Map items (chests, workstations, etc.) can be hacked from a distance using the GREMLIN."
LocDefaultSecondaryWeapon="GREMLIN"

[TargetDefinition X2AbilityTemplate]
LocFriendlyName="Target Definition"
LocLongDescription="Any unit seen by a <Ability:ClassName/> remains permanently visible."
LocHelpText="Any unit seen by a <Ability:ClassName/> remains permanently visible."
LocPromotionPopupText="<Bullet/> Scouting with the <Ability:ClassName/> will allow enemies to be tracked even if they enter the fog of war.<br/>"

[TargetDefinitionPassive X2AbilityTemplate]
LocFriendlyName="Target Definition"
LocLongDescription="Any unit seen by a <Ability:ClassName/> remains permanently visible."
LocHelpText="Any unit seen by a <Ability:ClassName/> remains permanently visible."

[ThrowClaymore X2AbilityTemplate]
LocFriendlyName="Claymore"
LocLongDescription="Throws a targetable environmental explosive. The <Ability:ClassName/> is not revealed when shooting the Claymore or when it is triggered."
LocHelpText="Throws a targetable environmental explosive. The <Ability:ClassName/> is not revealed when shooting the Claymore or when it is triggered."
LocPromotionPopupText="<Bullet/> Claymores can be targeted by squadmates.<br/><Bullet/> Claymores allow the <Ability:ClassName/> to be a part of an ambush without risking being revealed.<br/>"

[ThrowShrapnel X2AbilityTemplate]
LocFriendlyName="Claymore (Shrapnel)"
LocLongDescription="Throws a targetable environmental explosive. The <Ability:ClassName/> is not revealed when shooting the Claymore or when it is triggered."
LocHelpText="Throws a targetable environmental explosive. The <Ability:ClassName/> is not revealed when shooting the Claymore or when it is triggered."

[Highlands X2AbilityTemplate]
LocFriendlyName="Highlands"
LocLongDescription="Soldier can carry an additional claymore on a mission."
LocHelpText="Soldier can carry an additional claymore on a mission."
LocPromotionPopupText="<Bullet/> An extra Claymore allows the <Ability:ClassName/> to inflict serious collateral damage during a mission.<br/>"

[Distraction X2AbilityTemplate]
LocFriendlyName="Distraction"
LocLongDescription="A kill with the Claymore puts the <Ability:ClassName/> into Shadow."
LocHelpText="A kill with the Claymore puts the <Ability:ClassName/> into Shadow."
LocPromotionPopupText="<Bullet/> Will trigger on any kill from the Claymore, regardless of which soldier targets it.<br/>"

[BloodTrail X2AbilityTemplate]
LocFriendlyName="Blood Trail"
LocLongDescription="Shots deal +<Ability:BLOODTRAILDAMAGE/> damage if the target has been wounded this turn."
LocHelpText="Shots deal +<Ability:BLOODTRAILDAMAGE/> damage if the target has been wounded this turn."
LocPromotionPopupText="<Bullet/> Only applies on the same turn the enemy is damaged.<br/><Bullet/> Plan ahead with squadmate attacks to take full advantage of Blood Trail.<br/>"

[Shrapnel X2AbilityTemplate]
LocFriendlyName="Shrapnel"
LocHelpText="Claymore does +<Ability:SHRAPNELDAMAGE/> damage and has +<Ability:SHRAPNELRADIUS/> radius."
LocLongDescription="Claymore does +<Ability:SHRAPNELDAMAGE/> damage and has +<Ability:SHRAPNELRADIUS/> radius."
LocPromotionPopupText="<Bullet/> Shrapnel bonuses apply to every Claymore the <Ability:ClassName/> carries.<br/>"

[Needle X2AbilityTemplate]
LocFriendlyName="Needle"
LocHelpText="Shots taken in Shadow have +<Ability:NEEDLEPIERCE/> armor piercing."
LocLongDescription="Shots taken in Shadow have +<Ability:NEEDLEPIERCE/> armor piercing."
LocPromotionPopupText="<Bullet/> Use Shadow's extra mobility to get close and deal major damage with Needle.<br/><Bullet/> Only applies while the <Ability:ClassName/> is in Shadow.<br/>"

[PaleHorse X2AbilityTemplate]
LocFriendlyName="Soul Harvest"
LocLongDescription="Kill shots increase crit chance by <Ability:SOULHARVESTCRIT/>, to a maximum of <Ability:SOULHARVESTMAX/>."
LocHelpText="Kill shots increase crit chance by <Ability:SOULHARVESTCRIT/>, to a maximum of <Ability:SOULHARVESTMAX/>."
LocFlyoverText="Soul Harvest"
LocPromotionPopupText="<Bullet/> Only applies on shots taken with the Vektor Rifle.<br/>"

[HomingMine X2AbilityTemplate]
LocFriendlyName="Homing Mine"
LocLongDescription="Attach a claymore onto an enemy (does not alert the enemy). The Homing mine will explode upon that enemy taking damage."
LocHelpText="Attach a claymore onto an enemy (does not alert the enemy). The Homing mine will explode upon that enemy taking damage."
LocPromotionPopupText="<Bullet/> Shots against the mined target are guaranteed to hit.<br/><Bullet/> Charges are shared with the normal Claymore ability.<br/><Bullet/> Shrapnel bonuses also apply to Homing Mine Claymores.<br/>"

[RemoteStart X2AbilityTemplate]
LocFriendlyName="Remote Start"
LocLongDescription="Detonate an environmental explosive, causing it to deal double damage within twice its normal radius. Does not reveal the <Ability:ClassName/>."
LocHelpText="Detonate an environmental explosive, causing it to deal double damage within twice its normal radius. Does not reveal the <Ability:ClassName/>."
LocPromotionPopupText="<Bullet/> Make sure squadmates are clear of the blast zone!<br/><Bullet/> Remote Start requires <Ability:SelfAmmoCost/> ammo point, and has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[Soul<Ability:ClassName/> X2AbilityTemplate]
LocFriendlyName="Banish"
LocLongDescription="Fire at a target until you run out of ammo or it dies. Reveals the <Ability:ClassName/>."
LocHelpText="Fire at a target until you run out of ammo or it dies. Reveals the <Ability:ClassName/>."
LocFlyoverText="Banish"
LocPromotionPopupText="<Bullet/> Each shot in Banish rolls a separate chance to hit.<br/><Bullet/> Banish can only be activated once per mission.<br/><Bullet/> Upgrade your Vektor Rifle with an Expanded Magazine to increase the potency of Banish.<br/><Bullet/> Banish cannot be activated with only 1 ammo remaining.<br/>"

[Soul<Ability:ClassName/>Continue X2AbilityTemplate]
LocFriendlyName="Banish"
LocLongDescription="Fire at a target until until you run out of ammo or it dies. Reveals the <Ability:ClassName/>."
LocHelpText="Fire at a target until until you run out of ammo or it dies. Reveals the <Ability:ClassName/>."
LocFlyoverText="Banish"

[SoulHarvester X2AbilityTemplate]
LocFriendlyName="Annihilate"
LocLongDescription="When you kill a target with Banish, you will continue firing at another enemy (until you run out of ammo)."
LocHelpText="When you kill a target with Banish, you will continue firing at another enemy (until you run out of ammo)."
LocFlyoverText="Annihilate"
LocPromotionPopupText="<Bullet/> Activate Banish deep in the enemy line to get maximum value from Annihilate.<br/><Bullet/> Next target must be within line of sight of the <Ability:ClassName/>.<br/>"

[Sting X2AbilityTemplate]
LocFriendlyName="Sting"
LocLongDescription="Fire a shot while in Shadow. Guaranteed to remain in Shadow."
LocHelpText="Fire a shot while in Shadow. Guaranteed to remain in Shadow."
LocPromotionPopupText="<Bullet/> Sting allows for the <Ability:ClassName/> to attack in situations where they absolutely do not want to be revealed.<br/><Bullet/> Sting has one charge per mission, requires <Ability:SelfAmmoCost/> ammo points, and has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[ImprovisedSilencer X2AbilityTemplate]
LocFriendlyName="Improvised Silencer"
LocLongDescription="Reduce chance to break Shadow Concealment on first shot of mission by <Ability:IMPROVISEDSILENCERREDUCTION/>%"
LocHelpText="Reduce chance to break Shadow Concealment on first shot of mission by <Ability:IMPROVISEDSILENCERREDUCTION/>%"

[Infiltration X2AbilityTemplate]
LocFriendlyName="Infiltration"
LocLongDescription="Increases hacking by +<Ability:INFILTRATIONHACKINGBONUS/>. ADVENT security towers cannot see this unit when it's concealed."
LocHelpText="Increases hacking by +<Ability:INFILTRATIONHACKINGBONUS/>. ADVENT security towers cannot see this unit when it's concealed."

[X2Ability_<Ability:ClassName/>AbilitySet]
HomineMinePenaltyDescription="Shots that target this unit are guaranteed to hit. The Homing Mine will explode upon this unit taking damage."

; HERO CLASS - TEMPLAR
[TemplarFocus X2AbilityTemplate]
LocFriendlyName="Focus"
LocLongDescription="Gain Focus during missions, increasing stats, damage, and ability effectiveness. Focus can be spent on powerful abilities."
LocPromotionPopupText="<Bullet/> Templars begin missions weaker than other soldiers, but can become extremely powerful at higher Focus levels. Effectively managing Focus to get the most out of the stat boosts and each ability is critical to using a <Ability:ClassName/>.<br/><Bullet/> Focus is gained by killing enemies with Rend.<br/><Bullet/> Focus Level 1: Rend Damage +<Ability:FOCUS1RENDDAMAGE/>, Mobility +<Ability:FOCUS1MOBILITY/>, Dodge +<Ability:FOCUS1DODGE/><br/><Bullet/> Focus Level 2: Rend Damage +<Ability:FOCUS2RENDDAMAGE/>, Mobility +<Ability:FOCUS2MOBILITY/>, Dodge +<Ability:FOCUS2DODGE/><br/><Bullet/> Focus Level 3: Rend Damage +<Ability:FOCUS3RENDDAMAGE/>, Mobility +<Ability:FOCUS3MOBILITY/>, Dodge +<Ability:FOCUS3DODGE/><br/>"

[FocusKillTracker X2AbilityTemplate]
LocFriendlyName="Focus"

[Rend X2AbilityTemplate]
LocFriendlyName="Rend"
LocLongDescription="Melee attack with a chance to stun or disorient the target. Cannot miss. Triggers Momentum, and generates Focus on kills."
LocHelpText="Melee attack with a chance to stun or disorient the target. Triggers Momentum, and generates Focus on kills."
LocPromotionPopupText="<Bullet/> Using Rend to kill enemies is the <Ability:ClassName/>'s primary method for generating Focus.<br/><Bullet/> Rend's damage is increased at higher Focus levels.<br/><Bullet/> After casting Rend, the <Ability:ClassName/> will gain Momentum, allowing them one movement action. Use this to return to cover after attacking.<br/><Bullet/> Rend has a <Ability:RENDSTUNCHANCE/>% chance to Stun per Focus. Stunned targets will also be knocked back.<br/><Bullet/> Rend has a <Ability:RENDDISORIENTCHANCE/>% chance to Disorient per Focus.<br/>"

[Overcharge X2AbilityTemplate]
LocFriendlyName="Overcharge"
LocLongDescription="Rend attacks have a <Ability:OVERCHARGECHANCE/>% chance to generate Focus."
LocHelpText="Rend attacks have a <Ability:OVERCHARGECHANCE/>% chance to generate Focus."
LocFlyOverText="Overcharge"
LocPromotionPopupText="<Bullet/> Overcharge only applies to non-lethal attacks.<br/><Bullet/> Overcharge can significantly increase the speed at which Templars generate Focus in missions.<br/>"

[OverchargePassive X2AbilityTemplate]
LocFriendlyName="Overcharge"
LocLongDescription="Non-lethal Rend attacks have a <Ability:OVERCHARGECHANCE/>% chance to generate Focus."
LocHelpText="Non-lethal Rend attacks have a <Ability:OVERCHARGECHANCE/>% chance to generate Focus."
LocFlyOverText="Overcharge"
LocPromotionPopupText="<Bullet/> Overcharge only applies to non-lethal attacks.<br/><Bullet/> Overcharge can significantly increase the speed at which Templars generate Focus in missions.<br/>"

; ArcWave is a copy of Rend text since it completely replaces the ability in Tactical. ArcWavePassive text is displayed in Strategy.
[ArcWave X2AbilityTemplate]
LocFriendlyName="Rend"
LocLongDescription="Melee attack with a chance to stun or disorient the target. Cannot miss. Triggers Momentum, and generates Focus on kills."
LocHelpText="Melee attack with a chance to stun or disorient the target. Triggers Momentum, and generates Focus on kills."

[ArcWavePassive X2AbilityTemplate]
LocFriendlyName="Arc Wave"
LocLongDescription="Rend generates a wave of Psionic energy in the direction of the attack. Damage increases with Focus level."
LocHelpText="Rend generates a wave of Psionic energy in the direction of the attack."
LocPromotionPopupText="<Bullet/> Arc Wave does not affect the target of the original Rend attack.<br/><Bullet/> Arc Wave deals damage equal to double the <Ability:ClassName/>'s current Focus level, or 1 if they have no Focus.<br/><Bullet/> Arc Wave travels through environmental objects.<br/>"

[Momentum X2AbilityTemplate]
LocFriendlyName="Momentum"
LocLongDescription="After using Rend, gain a bonus movement action."
LocHelpText="Gain up to one move per turn after using Rend."
LocFlyOverText="Momentum"

[MomentumPassive X2AbilityTemplate]
LocFriendlyName="Momentum"
LocLongDescription="After using Rend, gain a bonus movement action."
LocHelpText="Gain up to one move per turn after using Rend."
LocFlyOverText="Momentum"

[X2Effect_ModifyTemplarFocus]
FlyoverText="<FocusAmount/> Focus"

[Volt X2AbilityTemplate]
LocFriendlyName="Volt"
LocLongDescription="Psionic attack that deals low damage, but jumps to nearby units at higher Focus levels. Costs 1 Focus."
LocHelpText="Psionic attack that can jump to nearby units. Costs 1 Focus."
LocPromotionPopupText="<Bullet/> Volt has no cooldown, but costs 1 Focus.<br/><Bullet/> Volt deals double damage to Psionic units.<br/><Bullet/> Volt can jump to a number of enemies equal to the current Focus level.<br/>"

[Parry X2AbilityTemplate]
LocFriendlyName="Parry"
LocLongDescription="After attacking with Rend, prevent all damage from the next attack instead of moving."
LocHelpText="After attacking with Rend, prevent all damage from the next attack instead of moving."
LocFlyoverText="Parried!"
LocPromotionPopupText="<Bullet/> Parry will prevent damage from both melee and ranged attacks.<br/><Bullet/> Parry will use the action granted by Momentum.<br/>"

[ParryActivate X2AbilityTemplate]
LocFriendlyName="Parry"
LocLongDescription="Parry the next attack made against you during the enemy turn, preventing all damage."
LocHelpText="Parry the next attack made against you during the enemy turn, preventing all damage."
LocFlyoverText="Parried!"

[Amplify X2AbilityTemplate]
LocFriendlyName="Amplify"
LocLongDescription="Mark a single target with a Psionic lens, causing them to take an additional <Ability:AmplifyDamageMult/>% damage from a number of future single-target attacks. Costs 1 Focus."
LocHelpText="Mark a target, causing them to take additional damage from single-target attacks. Costs 1 Focus."
LocHitMessage="Amplified"
LocPromotionPopupText="<Bullet/> Amplify will last for a number of successful attacks equal to the <Ability:ClassName/>'s Focus level when activated.<br/><Bullet/> Amplify does not end the <Ability:ClassName/>'s turn.<br/>"

[X2Effect_Amplify]
AmplifyRemoved="Amplify Ended"
AmplifyCountdown="Amplify Hits Remaining: %d"

[Pillar X2AbilityTemplate]
LocFriendlyName="Pillar"
LocLongDescription="Summon a pillar of Psionic energy to act as a high cover point. Costs 1 Focus."
LocHelpText="Summon high cover at a target location. Costs 1 Focus."
LocPromotionPopupText="<Bullet/> The pillar will last for a number of turns equal to the <Ability:ClassName/>'s Focus level when summoned.<br/><Bullet/> Pillar does not end the <Ability:ClassName/>'s turn.<br/>"

[Channel X2AbilityTemplate]
LocFriendlyName="Channel"
LocLongDescription="When an enemy dies, it may leave behind Psionic energy the <Ability:ClassName/> can collect to raise their Focus level."
LocHelpText="Enemies may drop Psionic energy the <Ability:ClassName/> can collect to raise their Focus level."
LocPromotionPopupText="<Bullet/> Enemies have a <Ability:CHANNELLOOTCHANCE/>% chance to drop Psionic loot.<br/><Bullet/> Psionic enemies have a <Ability:CHANNELLOOTPSICHANCE/>% chance to drop Psionic loot.<br/>"

[ChannelPassive X2AbilityTemplate]
LocFriendlyName="Channel"
LocLongDescription="When an enemy dies, it may leave behind Psionic energy the <Ability:ClassName/> can collect to raise their Focus level."
LocHelpText="Enemies may drop Psionic energy the <Ability:ClassName/> can collect to raise their Focus level."
LocPromotionPopupText="<Bullet/> Enemies have a <Ability:CHANNELLOOTCHANCE/>% chance to drop Psionic loot.<br/><Bullet/> Psionic enemies have a <Ability:CHANNELLOOTPSICHANCE/>% chance to drop Psionic loot."

[Deflect X2AbilityTemplate]
LocFriendlyName="Deflect"
LocLongDescription="When the <Ability:ClassName/> has Focus, there is a chance to deflect incoming shots, completely avoiding the damage."
LocHelpText="When Focused, there is a chance to deflect incoming shots."
LocPromotionPopupText="<Bullet/> Deflect has a <Ability:DEFLECTCHANCE/>% chance to activate at Focus Level 1, which increases by <Ability:DEFLECTCHANCEPERFOCUS/>% with each additional Focus level.<br/><Bullet/> Only ranged, single-target attacks can be deflected.<br/>"

[Reflect X2AbilityTemplate]
LocFriendlyName="Reflect"
LocLongDescription="When the <Ability:ClassName/> has two or more Focus, there is a chance to reflect incoming shots back at the attacker, completely avoiding the damage."
LocHelpText="When Focused, there is a chance to reflect incoming shots back at the attacker."
LocPromotionPopupText="<Bullet/> Reflect has a <Ability:REFLECTCHANCE/>% chance to activate at Focus Level 2, which increases by <Ability:DEFLECTCHANCEPERFOCUS/>% with each additional Focus level.<br/><Bullet/> Only ranged, single-target attacks can be reflected.<br/>"

[ReflectShot X2AbilityTemplate]
LocFriendlyName="Reflect"
LocLongDescription="When Focused, there is a chance to reflect incoming shots back at the attacker."
LocHelpText="When the <Ability:ClassName/> has two or more Focus, there is a chance to reflect incoming shots back at the attacker, completely avoiding the damage."

[TemplarInvert X2AbilityTemplate]
LocFriendlyName="Invert"
LocLongDescription="Switch locations with an enemy unit. Costs 1 Focus."
LocHelpText="Switch locations with an enemy unit. Costs 1 Focus."
LocPromotionPopupText="<Bullet/> Invert has a <Ability:SelfCooldown/> turn cooldown, and does not end the <Ability:ClassName/>'s turn.<br/>"

[TemplarExchange X2AbilityTemplate]
LocFriendlyName="Exchange"
LocLongDescription="Exchange locations with a squadmate. Costs 1 Focus."
LocHelpText="Exchange locations with a squadmate. Costs 1 Focus."
LocPromotionPopupText="<Bullet/> Exchange has a <Ability:SelfCooldown/> turn cooldown, and does not end the <Ability:ClassName/>'s turn.<br/>"

[DeepFocus X2AbilityTemplate]
LocFriendlyName="Deep Focus"
LocLongDescription="The maximum Focus level is increased to 3."
LocHelpText="The maximum Focus level is increased to 3."
LocPromotionPopupText="<Bullet/> Focus Level 3: Rend Damage +<Ability:FOCUS3RENDDAMAGE/>, Mobility +<Ability:FOCUS3MOBILITY/>, Dodge +<Ability:FOCUS3DODGE/><br/>"

[Ghost X2AbilityTemplate]
LocFriendlyName="Ghost"
LocLongDescription="Create a duplicate of the <Ability:ClassName/> from the body of a fallen humanoid. The Ghost disappears when it loses all Focus. Costs 2 Focus."
LocHelpText="Summon a duplicate <Ability:ClassName/> from the fallen body of a humanoid enemy. Costs 2 Focus."
LocPromotionPopupText="<Bullet/> Ghosts start with Focus equal to the <Ability:ClassName/>'s Focus level when created.<br/><Bullet/> Ghosts cannot gain Focus, and disappear when all Focus is spent, or their health reaches 0.<br/><Bullet/> Rend costs 1 Focus when used by Ghosts.<br/><Bullet/> Ghost must be cast on the corpse of a humanoid enemy, and cannot be cast on the same corpse twice.<br/>"

[Reverberation X2AbilityTemplate]
LocFriendlyName="Aftershock"
LocLongDescription="Targets struck by Volt will be easier to hit, increasing your squad's aim by +<Ability:RECOILAIMBONUS/> against the target."
LocHelpText="Targets struck by Volt will be easier to hit."
LocPromotionPopupText="<Bullet/> Aftershock will last for 2 turns.<br/><Bullet/> Aftershock will affect all of the units hit by Volt if it jumps multiple times.<br/>"

[IonicStorm X2AbilityTemplate]
LocFriendlyName="Ionic Storm"
LocLongDescription="Summon lightning to strike all nearby enemies. Damage increases with Focus level. Costs all Focus, but generates Focus on kills."
LocHelpText="Summon lightning to strike all nearby enemies. Costs all Focus, but generates Focus on kills."
LocPromotionPopupText="<Bullet/> Ionic Storm's radius increases at higher Focus levels.<br/><Bullet/> Ionic Storm deals double damage to Psionic units.<br/><Bullet/> Use Ionic Storm at a high Focus level when it will kill many targets to immediately refund the Focus cost.<br/><Bullet/> Ionic Storm has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[VoidConduit X2AbilityTemplate]
LocFriendlyName="Void Conduit"
LocLongDescription="Trap a humanoid in a Psionic prison, immobilizing them for multiple actions and transferring their health to the <Ability:ClassName/>. Costs 1 Focus."
LocHelpText="Immobilize a humanoid for multiple actions, and transfer their health to the <Ability:ClassName/>. Costs 1 Focus."
LocPromotionPopupText="<Bullet/> Void Conduit will deal <Ability:VOIDCONDUITDMG/> damage initially, then drain <Ability:VOIDCONDUITACTIONDMG/> health per enemy action.<br/><Bullet/> Void Conduit lasts for enemy actions equal to the <Ability:ClassName/>'s Focus level when cast.<br/><Bullet/> Targets trapped by Void Conduit cannot take actions or dodge, but can be targeted by other attacks.<br/>"

[StunStrike X2AbilityTemplate]
LocFriendlyName="Stun Strike"
LocLongDescription="Strike an enemy with Psionic force, knocking them back in the direction of the attack. Costs 1 Focus."
LocHelpText="Knock an enemy back in the direction of the attack. Costs 1 Focus."
LocPromotionPopupText="<Bullet/> Stun Strike has a <Ability:STUNSTRIKEHITCHANCE/>% chance to hit, increased by <Ability:STUNSTRIKEFOCUSHITCHANCE/>% for each Focus level.<br/><Bullet/> Stun Strike has a <Ability:STUNSTRIKEDISORIENTCHANCE/>% chance to disorient the target for each Focus level.<br/><Bullet/> Stun Strike does not end the <Ability:ClassName/>'s turn, but has a <Ability:SelfCooldown/> turn cooldown.<br/>" 

[TemplarBladestorm X2AbilityTemplate]
LocFriendlyName="Bladestorm"
LocLongDescription="Free <Ability:WeaponName/> attacks on any enemies that enter or attack from melee range."
LocHelpText="Free <Ability:WeaponName/> attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Bladestorm"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Bladestorm will trigger if that enemy tries to attack the <Ability:ClassName/>.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Bladestorm will trigger when that enemy moves into melee range.<br/>"

[TemplarBladestormAttack X2AbilityTemplate]
LocFriendlyName="Bladestorm"
LocLongDescription="Free <Ability:WeaponName/> attacks on any enemies that enter or attack from melee range."
LocHelpText="Free <Ability:WeaponName/> attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Bladestorm"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Bladestorm will trigger if that enemy tries to attack the <Ability:ClassName/>.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Bladestorm will trigger when that enemy moves into melee range.<br/>"

[MeditationPreparation X2AbilityTemplate]
LocFriendlyName="Mentally Awake"
LocLongDescription="Start every mission with <Ability:MEDITATIONPREPARATIONSTARTINGFOCUS/> Focus."
LocHelpText="Start every mission with <Ability:MEDITATIONPREPARATIONSTARTINGFOCUS/> Focus."

[MeditationPreparationPassive X2AbilityTemplate]
LocFriendlyName="Mentally Awake"
LocLongDescription="Start every mission with <Ability:MEDITATIONPREPARATIONSTARTINGFOCUS/> Focus."
LocHelpText="Start every mission with <Ability:MEDITATIONPREPARATIONSTARTINGFOCUS/> Focus."

; HERO CLASS - SKIRMISHER
[SkirmisherGrapple X2AbilityTemplate]
LocFriendlyName="Grapple"
LocHelpText="Deploy a grappling hook to move quickly to an elevated position."
LocLongDescription="Deploy a grappling hook to move quickly to an elevated position."
LocPromotionPopupText="<Bullet/> Grapple allows the <Ability:ClassName/> to get into position without using an action.<br/><Bullet/> Grapple has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[SkirmisherStrike X2AbilityTemplate]
LocFriendlyName="Marauder"
LocLongDescription="Standard shots are not turn-ending, allowing for shooting then moving or shooting twice on a turn."
LocHelpText="Standard shots are not turn-ending, allowing for shooting then moving or shooting twice on a turn."
LocPromotionPopupText="<Bullet/> Marauder provides more tactical options when planning the <Ability:ClassName/>'s turn.<br/><Bullet/> Paired with Grapple, Marauder allows the <Ability:ClassName/> to shoot twice and move on a single turn.<br/>"

[SkirmisherReflex X2AbilityTemplate]
LocFriendlyName="Reflex"
LocLongDescription="When fired upon, gain one extra action on the next turn. Triggers once per mission."
LocHelpText="When fired upon, gain one extra action on the next turn. Triggers once per mission."
LocFlyoverText="Reflex: +1 Action Next Turn"
LocPromotionPopupText="<Bullet/> The Grapple makes the <Ability:ClassName/> a great advance scout, and Reflex rewards their aggressive positioning.<br/><Bullet/> Reflex can only be triggered once per mission.<br/>"

[Parkour X2AbilityTemplate]
LocFriendlyName="Parkour"
LocLongDescription="<Ability:PARKOURTRIGGERCHANCE/>% chance for a free move after the first move of the turn."
LocHelpText="<Ability:PARKOURTRIGGERCHANCE/>% chance for a free move after the first move of the turn."

[ParkourPassive X2AbilityTemplate]
LocFriendlyName="Parkour"
LocLongDescription="<Ability:PARKOURTRIGGERCHANCE/>% chance for a free move after the first move of the turn."
LocHelpText="<Ability:PARKOURTRIGGERCHANCE/>% chance for a free move after the first move of the turn."

[FullThrottle X2AbilityTemplate]
LocFriendlyName="Full Throttle"
LocLongDescription="Gain +<Ability:FULLTHROTTLEMOBILITY/> mobility with every kill this turn."
LocHelpText="Gain +<Ability:FULLTHROTTLEMOBILITY/> mobility with every kill this turn."
LocPromotionPopupText="<Bullet/> Firing does not end your turn, so secure kills at the beginning of turns to take advantage of Full Throttle.<br/><Bullet/> Only kills by the <Ability:ClassName/> count towards Full Throttle.<br/>"

[FullThrottlePassive X2AbilityTemplate]
LocFriendlyName="Full Throttle"
LocLongDescription="Gain +<Ability:FULLTHROTTLEMOBILITY/> mobility with every kill this turn."
LocHelpText="Gain +<Ability:FULLTHROTTLEMOBILITY/> mobility with every kill this turn."
LocPromotionPopupText="<Bullet/> Firing does not end your turn, so secure kills at the beginning of turns to take advantage of Full Throttle.<br/><Bullet/> Only kills by the <Ability:ClassName/> count towards Full Throttle.<br/>"

[SkirmisherAmbush X2AbilityTemplate]
LocFriendlyName="Waylay"
LocLongDescription="When entering Overwatch, you can take as many shots as you have remaining actions."
LocHelpText="When entering Overwatch, you can take as many shots as you have remaining actions."
LocFlyoverText="Waylay"
LocPromotionPopupText="<Bullet/> Trigger an ambush with a squadmate to devastate the enemy with Waylay.<br/><Bullet/> Waylay is also limited by your remaining ammo.<br/>"

[CombatPresence X2AbilityTemplate]
LocFriendlyName="Combat Presence"
LocLongDescription="Grant an extra action to a squadmate."
LocHelpText="Grant an extra action to a squadmate."
LocPromotionPopupText="<Bullet/> Combat Presence can be used to get squadmates out of tough situations where they need an extra attack or move.<br/><Bullet/> Combat Presence has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[TotalCombat X2AbilityTemplate]
LocFriendlyName="Total Combat"
LocLongDescription="Throwing a grenade or using an item no longer ends the turn."
LocHelpText="Throwing a grenade or using an item no longer ends the turn."
LocPromotionPopupText="<Bullet/> Total Combat adds even more flexibility to the <Ability:ClassName/>'s turns, allowing actions to be taken exactly when needed.<br/>"

[ZeroIn X2AbilityTemplate]
LocFriendlyName="Zero In"
LocLongDescription="Subsequent shots on the same turn provide +<Ability:ZEROINCRIT/> critical chance. If against the same target, they also provide +<Ability:ZEROINAIM/> hit chance."
LocHelpText="Subsequent shots on the same turn provide +<Ability:ZEROINCRIT/> critical chance. If against the same target, they also provide +<Ability:ZEROINAIM/> hit chance."
LocFlyoverText="Zero In"
LocPromotionPopupText="<Bullet/> The <Ability:ClassName/>'s ability to accrue many actions per turn can result in massive bonuses from Zero In.<br/>"

[Retribution X2AbilityTemplate]
LocFriendlyName="Retribution"
LocLongDescription="Free Ripjack attacks on any enemies that enter or attack from melee range."
LocHelpText="Free Ripjack attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Retribution"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Retribution will trigger if that enemy tries to attack the <Ability:ClassName/>.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Retribution will trigger when that enemy moves into melee range.<br/>"

[RetributionAttack X2AbilityTemplate]
LocFriendlyName="Retribution"
LocLongDescription="Free Ripjack attacks on any enemies that enter or attack from melee range."
LocHelpText="Free Ripjack attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Retribution"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Retribution will trigger if that enemy tries to attack the <Ability:ClassName/>.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Retribution will trigger when that enemy moves into melee range.<br/>"

[Reckoning X2AbilityTemplate]
LocFriendlyName="Reckoning"
LocLongDescription="Unlocks the Ripjack Slash attack."
LocHelpText="Unlocks the Ripjack Slash attack."
LocFlyOverText="Reckoning"
LocPromotionPopupText="<Bullet/> You can trigger the Slash ability by placing the movement cursor over an enemy.<br/><Bullet/> A <Ability:ClassName/> can perform a \"Dash\" move, using both actions to move, and still trigger a Slash against an adjacent enemy.<br/><Bullet/> Slash has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[SkirmisherMelee X2AbilityTemplate]
LocFriendlyName="Slash"
LocLongDescription="Attack any enemy within movement range with your Ripjack."
LocHelpText="Attack an enemy within movement range with your Ripjack."
LocPromotionPopupText="<Bullet/> You can trigger the Slash ability by placing the movement cursor over an enemy.<br/><Bullet/> A <Ability:ClassName/> can perform a \"Dash\" move, using both actions to move, and still trigger a Slash against an adjacent enemy.<br/><Bullet/> Slash has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[Justice X2AbilityTemplate]
LocFriendlyName="Justice"
LocLongDescription="Use the Grapple to pull a humanoid target to you and deliver a Ripjack strike."
LocHelpText="Use the Grapple to pull a humanoid target to you and deliver a Ripjack strike."
LocPromotionPopupText="<Bullet/> Justice is a great way to pull an enemy out of position.<br/><Bullet/> The Ripjack strike is guaranteed to hit if the pull is successful.<br/><Bullet/> An open space adjacent to the <Ability:ClassName/> is needed to use Justice.<br/><Bullet/> Justice has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[SkirmisherVengeance X2AbilityTemplate]
LocFriendlyName="Wrath"
LocLongDescription="Use the Grapple to pull yourself to an enemy and deliver a Ripjack strike."
LocHelpText="Use the Grapple to pull yourself to an enemy and deliver a Ripjack strike."
LocPromotionPopupText="<Bullet/> Wrath adds extra mobility for the <Ability:ClassName/>, and can be used while the Grapple is on cooldown.<br/><Bullet/> The Ripjack strike is guaranteed to hit if the Grapple is successful.<br/><Bullet/> An open space adjacent to the enemy is needed to use Wrath.<br/><Bullet/> Wrath has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[Whiplash X2AbilityTemplate]
LocFriendlyName="Whiplash"
LocLongDescription="Attack an enemy with an electrical lash. This attack does not cost an action."
LocHelpText="A free attack with an electrical lash. Double damage to robotic units."
LocPromotionPopupText="<Bullet/> Whiplash does double damage to robotic enemies."

[ForwardOperator X2AbilityTemplate]
LocFriendlyName="Forward Operator"
LocLongDescription="When a new group of enemies is revealed, gain an action."
LocHelpText="When a new group of enemies is revealed, gain an action."
LocFlyoverText="Forward Operator"
LocPromotionPopupText="<Bullet/> Forward Operator allows the <Ability:ClassName/> to better handle enemies that surprise the squad.<br/>"

[ManualOverride X2AbilityTemplate]
LocFriendlyName="Manual Override"
LocLongDescription="Lower all ability cooldowns by 1."
LocHelpText="Lower all ability cooldowns by 1."
LocPromotionPopupText="<Bullet/> Use the <Ability:ClassName/>'s abilities early and often to take full advantage of Manual Override.<br/>"

[SkirmisherReturnFire X2AbilityTemplate]
LocFriendlyName="Return Fire"
LocHelpText="When targeted by enemy fire, automatically fire back with your <Ability:WeaponName/> once per turn."
LocLongDescription="When targeted by enemy fire, automatically fire back with your <Ability:WeaponName/> once per turn."
LocPromotionPopupText="<Bullet/> Return Fire will only trigger once per turn.<br/><Bullet/> Return Fire can be triggered by melee attacks and Area of Effect attacks.<br/><Bullet/> Return Fire will not trigger when targeted by Overwatch fire.<br/>"


[VektorRifle_CV X2WeaponTemplate]
FriendlyName="Vektor Rifle"
FriendlyNamePlural="Vektor Rifles"
BriefSummary="Reliant on a specialized cartridge presumably handloaded by the Reapers, the Vektor Rifle is a purpose-built sniper rifle designed for long range engagement and squad support. A relatively light weapon with excellent corrosion Resistance, it is ideal for the harsh environments typically associated with the Reaper faction."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> The Vektor Rifle is effective at all ranges.\n<Bullet/> Use upgrades looted from enemies to improve the Vektor Rifle's tactical effectiveness.\n<Bullet/>Vektor Rifles sport a integrated tactical suppressor."
AbilityDescName="vektor rifle"

[VektorRifle_MG X2WeaponTemplate]
FriendlyName="Temnotic Rifle"
FriendlyNamePlural="Temnotic Rifles"
BriefSummary="Modifying the existing Vektor rifle frame to allow for the integration of a magnetic accelerator, the weapon is now capable of firing ferromagnetic projectiles that can be mass produced by our engineering staff with relative ease. Damage output has been significantly improved as a result."
TacticalText="<Bullet/> Magnetized weapon technology makes for a lethal upgrade to the Reaper's Vektor Rifle.\n<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> The Temnotic Rifle is effective at all ranges.\n<Bullet/> Use upgrades looted from enemies to improve the Temnotic Rifle's tactical effectiveness.\n<Bullet/>Vektor Rifles sport a integrated tactical suppressor."
AbilityDescName="vektor rifle"

[VektorRifle_BM X2WeaponTemplate]
FriendlyName="Shadow Lance"
FriendlyNamePlural="Shadow Lances"
BriefSummary="Although the Reapers object to the use of alien technology in principle, we have assured them that beam weaponry under development here is of our own design. Regardless of their objections, the energy-based Vektor rifle is without question superior to any past variant they have ever wielded."
TacticalText="<Bullet/> This is most advanced Vektor Rifle variant available in the XCOM arsenal.\n<Bullet/> Firing the primary weapon always ends the soldier's turn, in the absence of special training.\n<Bullet/> They are less accurate at close range, but deadly at a distance.\n<Bullet/> Use upgrades looted from enemies to improve the Shadow Lance's tactical effectiveness.\n<Bullet/>Vektor Rifles sport a integrated tactical suppressor."
AbilityDescName="vektor rifle"

[TracerRounds X2AmmoTemplate]
FriendlyName="Tracer Rounds"
FriendlyNamePlural="Tracer Rounds"
BriefSummary="Containing high tech \"smart rounds\" that relay detailed tracking data back to the shooter when fired, this specialized ammo adds the holotargetting effect when equipped."
TacticalText="<Bullet/>Tracer rounds grant holotargeting to a soldier when equipped.<br>"
